In [50]:
# Importing Pandas
import pandas as pd
import numpy as np

In [51]:
# Create a DataFrame from the given data
data = {
    'Name': ['Amine', 'Imene', 'Yacine', 'Sarah', 'Redha'],
    'Age': [np.NaN, 30, 22, 35, 28],
    'City': ['Alger', 'Setif', 'Oran', 'Annaba', 'Jijel'],
    'Salary': [50000, 70000, 60000, 80000, 55000]
}

df = pd.DataFrame(data)

In [52]:
# 1. Display the first 3 rows of the DataFrame
first_3_rows = df.head(3)
print("1. Display the first 3 rows of the DataFrame:\n", first_3_rows)

1. Display the first 3 rows of the DataFrame:
      Name   Age   City  Salary
0   Amine   NaN  Alger   50000
1   Imene  30.0  Setif   70000
2  Yacine  22.0   Oran   60000

In [53]:
# 2. Find the number of rows and columns in the DataFrame
shape_of_df = df.shape
print("2. Find the number of rows and columns in the DataFrame:\n", shape_of_df)

2. Find the number of rows and columns in the DataFrame:
 (5, 4)

In [54]:
# 3. Display the unique values in the 'City' column
unique_cities = df['City'].unique
print("3. Display the unique values in the 'City' column:\n", unique_cities)

3. Display the unique values in the 'City' column:
 <bound method Series.unique of 0     Alger
1     Setif
2      Oran
3    Annaba
4     Jijel
Name: City, dtype: object>

In [55]:
# 4. Calculate the mean salary of the employees
mean_salary = df['Salary'].mean()
print("4. Calculate the mean salary of the employees:\n", mean_salary)

4. Calculate the mean salary of the employees:
 63000.0

In [56]:
# 5. Add a new column 'Bonus' with random bonus values (e.g., 1000, 1500, 1200, 2000, 1100)
df['Bonus'] = np.random.randint(1000, 5000, size=len(df))
print("5. Add a new column 'Bonus' with random bonus values:\n", df)

5. Add a new column 'Bonus' with random bonus values:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   2621
1   Imene  30.0   Setif   70000   1677
2  Yacine  22.0    Oran   60000   3116
3   Sarah  35.0  Annaba   80000   4094
4   Redha  28.0   Jijel   55000   1927

In [57]:
# 6. Drop the 'City' column from the DataFrame
df_without_city = df.drop(columns=['City'], axis=0)
print("6. Drop the 'City' column from the DataFrame:\n", df_without_city)

6. Drop the 'City' column from the DataFrame:
      Name   Age  Salary  Bonus
0   Amine   NaN   50000   2621
1   Imene  30.0   70000   1677
2  Yacine  22.0   60000   3116
3   Sarah  35.0   80000   4094
4   Redha  28.0   55000   1927

In [58]:
# 7. Select only the rows where the age is greater than 25
above_25_years = df[df['Age'] > 25]
print("7. Select only the rows where the age is greater than 25:\n", above_25_years)

7. Select only the rows where the age is greater than 25:
     Name   Age    City  Salary  Bonus
1  Imene  30.0   Setif   70000   1677
3  Sarah  35.0  Annaba   80000   4094
4  Redha  28.0   Jijel   55000   1927

In [59]:
# 8. Set the 'Name' column as the index of the DataFrame
df_with_index = df.set_index('Name')
print("8. Set the 'Name' column as the index of the DataFrame:\n", df_with_index)

8. Set the 'Name' column as the index of the DataFrame:
          Age    City  Salary  Bonus
Name
Amine    NaN   Alger   50000   2621
Imene   30.0   Setif   70000   1677
Yacine  22.0    Oran   60000   3116
Sarah   35.0  Annaba   80000   4094
Redha   28.0   Jijel   55000   1927

In [60]:
# 9. Reset the index of the DataFrame
df_reset_index = df_with_index.reset_index(drop=False, inplace=False)
print("9. Reset the index of the DataFrame:\n", df_reset_index)

9. Reset the index of the DataFrame:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   2621
1   Imene  30.0   Setif   70000   1677
2  Yacine  22.0    Oran   60000   3116
3   Sarah  35.0  Annaba   80000   4094
4   Redha  28.0   Jijel   55000   1927

In [61]:
# 10. Sort the DataFrame based on the 'Salary' column in descending order
sorted_df = df.sort_values(by='Salary', ascending=False, inplace=False)
print("10. Sort the DataFrame based on the 'Salary' column in descending order:\n", sorted_df)

10. Sort the DataFrame based on the 'Salary' column in descending order:
      Name   Age    City  Salary  Bonus
3   Sarah  35.0  Annaba   80000   4094
1   Imene  30.0   Setif   70000   1677
2  Yacine  22.0    Oran   60000   3116
4   Redha  28.0   Jijel   55000   1927
0   Amine   NaN   Alger   50000   2621

In [63]:
# 11. Group the DataFrame by the 'City' column and calculate the mean salary in each city
mean_salary_by_city = df.groupby('City')['Salary'].mean()
print("11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:\n", mean_salary_by_city)

11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:
 City
Alger     50000.0
Annaba    80000.0
Jijel     55000.0
Oran      60000.0
Setif     70000.0
Name: Salary, dtype: float64

In [64]:
# 12. Replace 'Yacine' with 'Selma' in the 'Name' column
df_replace_name = df['Name'].replace('Yacine', 'Selma')
print("12. Replace 'Charlie' with 'Eva' in the 'Name' column:\n", df_replace_name)

12. Replace 'Charlie' with 'Eva' in the 'Name' column:
 0    Amine
1    Imene
2    Selma
3    Sarah
4    Redha
Name: Name, dtype: object

In [65]:
# 13. Display the statistical summary of the DataFrame
summary_stats = df.describe()
print("13. Display the statistical summary of the DataFrame:\n", summary_stats)

13. Display the statistical summary of the DataFrame:
              Age        Salary        Bonus
count   4.000000      5.000000     5.000000
mean   28.750000  63000.000000  2687.000000
std     5.377422  12041.594579   970.276507
min    22.000000  50000.000000  1677.000000
25%    26.500000  55000.000000  1927.000000
50%    29.000000  60000.000000  2621.000000
75%    31.250000  70000.000000  3116.000000
max    35.000000  80000.000000  4094.000000

In [67]:
# 14. Fill missing values in the DataFrame with the mean of each column
df_filled_na = pd.DataFrame(df[['Age', 'Salary', 'Bonus']]) #[[]] for selecting multiple columns from the dataframe
df_filled_na = df.fillna(df_filled_na.mean())
print("14. Fill missing values in the DataFrame with the mean of each column:\n", df_filled_na)

14. Fill missing values in the DataFrame with the mean of each column:
      Name    Age    City  Salary  Bonus
0   Amine  28.75   Alger   50000   2621
1   Imene  30.00   Setif   70000   1677
2  Yacine  22.00    Oran   60000   3116
3   Sarah  35.00  Annaba   80000   4094
4   Redha  28.00   Jijel   55000   1927

In [68]:
# 15. Calculate the total salary expenditure by the company
total_salary_expenditure = df['Salary'].sum()
print("15. Calculate the total salary expenditure by the company:\n", total_salary_expenditure)

15. Calculate the total salary expenditure by the company:
 315000

In [71]:
# 16. Save the DataFrame to a CSV file named 'employee_data.csv'
df.to_csv('employee_data.csv', index=None)
print("16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.")

16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.

In [72]:
# 17. Read the 'employee_data.csv' file into a new DataFrame
new_df = pd.read_csv("employee_data.csv")
print("17. Read the 'employee_data.csv' file into a new DataFrame:\n", new_df)

17. Read the 'employee_data.csv' file into a new DataFrame:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   2621
1   Imene  30.0   Setif   70000   1677
2  Yacine  22.0    Oran   60000   3116
3   Sarah  35.0  Annaba   80000   4094
4   Redha  28.0   Jijel   55000   1927

In [73]:
# 18. Display the last 2 rows of the new DataFrame
last_2_rows_new_df = new_df.tail(2)
print("18. Display the last 2 rows of the new DataFrame:\n", last_2_rows_new_df)

18. Display the last 2 rows of the new DataFrame:
     Name   Age    City  Salary  Bonus
3  Sarah  35.0  Annaba   80000   4094
4  Redha  28.0   Jijel   55000   1927

In [77]:
# 19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary'
# rename() can both be used for renaming columns and index {old name:new name}
df_renamed_columns = df.rename(columns={'Name':'EmployeeName', 'Age':'EmployeeAge', 'City':'EmployeeCity', "Salary":'EmployeeSalary'})
print("19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':\n", df_renamed_columns)

19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':
   EmployeeName  EmployeeAge EmployeeCity  EmployeeSalary  Bonus
0        Amine          NaN        Alger           50000   2621
1        Imene         30.0        Setif           70000   1677
2       Yacine         22.0         Oran           60000   3116
3        Sarah         35.0       Annaba           80000   4094
4        Redha         28.0        Jijel           55000   1927

In [79]:
# 20. Create a new DataFrame with only 'Name' and 'Salary' columns
df_name_salary = df[['Name', 'Salary']]
print("20. Create a new DataFrame with only 'Name' and 'Salary' columns:\n", df_name_salary)

20. Create a new DataFrame with only 'Name' and 'Salary' columns:
      Name  Salary
0   Amine   50000
1   Imene   70000
2  Yacine   60000
3   Sarah   80000
4   Redha   55000

In [47]:
import pandas as pd
# Example DataFrame
data = {
    'Category': ['A', 'B', 'A', 'B', 'A'],
    'Value': [10, 20, 15, 25, 30]
}
df = pd.DataFrame(data)
# Group by 'Category' and calculate sum of 'Value'
grouped = df.groupby('Category').mean().reset_index()
grouped

  Category      Value
0        A  18.333333
1        B  22.500000